Ran Plan for project: `production` dir: `prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
- destroy

Terraform will perform the following actions:

  # module.http_redirects["broadinstitute-misspell"].google_compute_url_map.https_url_map will be updated in-place
! resource "google_compute_url_map" "https_url_map" {
        id                 = "projects/broad-redirect-prod/global/urlMaps/broadinstitute-misspell-https-ab0082c5"
        name               = "broadinstitute-misspell-https-ab0082c5"
        # (7 unchanged attributes hidden)

-       host_rule {
-           hosts        = [
-               "broadinsitute.org",
-               "broadinstittute.org",
-               "broadinstitute-mit.org",
-               "broadintitute.com",
-               "broadintitute.org",
-               "broadlinstitute.com",
-               "broadlinstitute.net",
-               "broadlinstitute.org",
-               "broadlnstitute.com",
-               "broadlnstitute.net",
-               "broadlnstitute.org",
-               "broadlntitute.com",
-               "broadlntitute.org",
-               "broadnstitute.org",
-               "www.broadinsitute.org",
-               "www.broadinstittute.org",
-               "www.broadinstitute-mit.org",
-               "www.broadintitute.com",
-               "www.broadintitute.org",
-               "www.broadlinstitute.com",
-               "www.broadlinstitute.net",
-               "www.broadlinstitute.org",
-               "www.broadlnstitute.com",
-               "www.broadlnstitute.net",
-               "www.broadlnstitute.org",
-               "www.broadlntitute.com",
-               "www.broadlntitute.org",
-               "www.broadnstitute.org",
            ] -> null
-           path_matcher = "allpaths" -> null
            # (1 unchanged attribute hidden)
        }
+       host_rule {
+           hosts        = [
+               "broadinsitute.org",
+               "broadinstittute.org",
+               "broadinstitute-mit.org",
+               "broadlinstitute.com",
+               "broadlinstitute.net",
+               "broadlinstitute.org",
+               "broadlnstitute.com",
+               "broadlnstitute.net",
+               "broadlnstitute.org",
+               "broadlntitute.com",
+               "broadlntitute.org",
+               "broadnstitute.org",
+               "www.broadinsitute.org",
+               "www.broadinstittute.org",
+               "www.broadinstitute-mit.org",
+               "www.broadlinstitute.com",
+               "www.broadlinstitute.net",
+               "www.broadlinstitute.org",
+               "www.broadlnstitute.com",
+               "www.broadlnstitute.net",
+               "www.broadlnstitute.org",
+               "www.broadlntitute.com",
+               "www.broadlntitute.org",
+               "www.broadnstitute.org",
            ]
+           path_matcher = "allpaths"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.http_redirects["broadinstitute-org"].google_compute_url_map.https_url_map will be updated in-place
! resource "google_compute_url_map" "https_url_map" {
        id                 = "projects/broad-redirect-prod/global/urlMaps/broadinstitute-org-https-1d59e983"
        name               = "broadinstitute-org-https-1d59e983"
        # (7 unchanged attributes hidden)

-       host_rule {
-           hosts        = [
-               "broadinstitute.mobi",
-               "broadinstitute.org",
-               "www.broadinstitute.mobi",
            ] -> null
-           path_matcher = "allpaths" -> null
            # (1 unchanged attribute hidden)
        }
+       host_rule {
+           hosts        = [
+               "broad.dev",
+               "broad.im",
+               "broad.institute",
+               "broad.us",
+               "broadapis.org",
+               "broadapps.com",
+               "broadapps.net",
+               "broadapps.org",
+               "broadinstitute.com",
+               "broadinstitute.info",
+               "broadinstitute.mobi",
+               "broadinstitute.net",
+               "broadinstitute.org",
+               "broadinstitute.tv",
+               "broadinstitute.us",
+               "localmail.broadinstitute.org",
+               "redirect.broadinstitute.org",
+               "test.broadinstitute.com",
+               "test.broadinstitute.net",
+               "test.broadinstitute.org",
+               "test.broadinstitute.us",
+               "thebroadinstitute.com",
+               "thebroadinstitute.info",
+               "thebroadinstitute.net",
+               "thebroadinstitute.org",
+               "thebroadinstitute.us",
+               "www.broad.dev",
+               "www.broad.im",
+               "www.broad.institute",
+               "www.broad.us",
+               "www.broadapis.org",
+               "www.broadapps.com",
+               "www.broadapps.net",
+               "www.broadapps.org",
+               "www.broadinstitute.com",
+               "www.broadinstitute.info",
+               "www.broadinstitute.mobi",
+               "www.broadinstitute.net",
+               "www.broadinstitute.tv",
+               "www.broadinstitute.us",
+               "www.test.broadinstitute.com",
+               "www.test.broadinstitute.net",
+               "www.test.broadinstitute.org",
+               "www.test.broadinstitute.us",
+               "www.thebroadinstitute.com",
+               "www.thebroadinstitute.info",
+               "www.thebroadinstitute.net",
+               "www.thebroadinstitute.org",
+               "www.thebroadinstitute.us",
            ]
+           path_matcher = "allpaths"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadintitute.com"] will be destroyed
  # (because key ["broadintitute.com"] is not in for_each map)
- resource "google_certificate_manager_certificate" "certificates" {
-       description      = "Certificate for broadintitute.com" -> null
-       effective_labels = {
-           "goog-terraform-provisioned" = "true"
        } -> null
-       id               = "projects/broad-redirect-prod/locations/global/certificates/broadintitute-com-ab0082c5" -> null
-       labels           = {} -> null
-       location         = "global" -> null
-       name             = "broadintitute-com-ab0082c5" -> null
-       project          = "broad-redirect-prod" -> null
-       san_dnsnames     = [
-           "broadintitute.com",
-           "www.broadintitute.com",
        ] -> null
-       terraform_labels = {
-           "goog-terraform-provisioned" = "true"
        } -> null
        # (1 unchanged attribute hidden)

-       managed {
-           authorization_attempt_info = [
-               {
-                   domain         = "broadintitute.com"
-                   failure_reason = "CONFIG"
-                   state          = "FAILED"
                    # (1 unchanged attribute hidden)
                },
-               {
-                   domain         = "www.broadintitute.com"
-                   failure_reason = "CONFIG"
-                   state          = "FAILED"
                    # (1 unchanged attribute hidden)
                },
            ] -> null
-           dns_authorizations         = [] -> null
-           domains                    = [
-               "broadintitute.com",
-               "www.broadintitute.com",
            ] -> null
-           provisioning_issue         = [
-               {
-                   reason  = "AUTHORIZATION_ISSUE"
                    # (1 unchanged attribute hidden)
                },
            ] -> null
-           state                      = "PROVISIONING" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadintitute.org"] will be destroyed
  # (because key ["broadintitute.org"] is not in for_each map)
- resource "google_certificate_manager_certificate" "certificates" {
-       description      = "Certificate for broadintitute.org" -> null
-       effective_labels = {
-           "goog-terraform-provisioned" = "true"
        } -> null
-       id               = "projects/broad-redirect-prod/locations/global/certificates/broadintitute-org-ab0082c5" -> null
-       labels           = {} -> null
-       location         = "global" -> null
-       name             = "broadintitute-org-ab0082c5" -> null
-       project          = "broad-redirect-prod" -> null
-       san_dnsnames     = [
-           "broadintitute.org",
-           "www.broadintitute.org",
        ] -> null
-       terraform_labels = {
-           "goog-terraform-provisioned" = "true"
        } -> null
        # (1 unchanged attribute hidden)

-       managed {
-           authorization_attempt_info = [
-               {
-                   domain         = "broadintitute.org"
-                   failure_reason = "CONFIG"
-                   state          = "FAILED"
                    # (1 unchanged attribute hidden)
                },
-               {
-                   domain         = "www.broadintitute.org"
-                   failure_reason = "CONFIG"
-                   state          = "FAILED"
                    # (1 unchanged attribute hidden)
                },
            ] -> null
-           dns_authorizations         = [] -> null
-           domains                    = [
-               "broadintitute.org",
-               "www.broadintitute.org",
            ] -> null
-           provisioning_issue         = [
-               {
-                   reason  = "AUTHORIZATION_ISSUE"
                    # (1 unchanged attribute hidden)
                },
            ] -> null
-           state                      = "PROVISIONING" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadintitute.com"] will be destroyed
  # (because key ["broadintitute.com"] is not in for_each map)
- resource "google_certificate_manager_certificate_map_entry" "certificates" {
-       certificates     = [
-           "projects/993744606360/locations/global/certificates/broadintitute-com-ab0082c5",
        ] -> null
-       create_time      = "2025-08-05T13:36:24.549017473Z" -> null
-       description      = "Certificate map entry for broadintitute.com" -> null
-       effective_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       hostname         = "broadintitute.com" -> null
-       id               = "projects/broad-redirect-prod/locations/global/certificateMaps/broadinstitute-misspell-ab0082c5/certificateMapEntries/broadintitute-com-ab0082c5" -> null
-       labels           = {
-           "acc-test"  = "true"
-           "terraform" = "true"
        } -> null
-       map              = "broadinstitute-misspell-ab0082c5" -> null
-       name             = "broadintitute-com-ab0082c5" -> null
-       project          = "broad-redirect-prod" -> null
-       state            = "ACTIVE" -> null
-       terraform_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       update_time      = "2025-08-05T13:36:27.185820260Z" -> null
        # (1 unchanged attribute hidden)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadintitute.org"] will be destroyed
  # (because key ["broadintitute.org"] is not in for_each map)
- resource "google_certificate_manager_certificate_map_entry" "certificates" {
-       certificates     = [
-           "projects/993744606360/locations/global/certificates/broadintitute-org-ab0082c5",
        ] -> null
-       create_time      = "2025-08-05T13:36:24.307230463Z" -> null
-       description      = "Certificate map entry for broadintitute.org" -> null
-       effective_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       hostname         = "broadintitute.org" -> null
-       id               = "projects/broad-redirect-prod/locations/global/certificateMaps/broadinstitute-misspell-ab0082c5/certificateMapEntries/broadintitute-org-ab0082c5" -> null
-       labels           = {
-           "acc-test"  = "true"
-           "terraform" = "true"
        } -> null
-       map              = "broadinstitute-misspell-ab0082c5" -> null
-       name             = "broadintitute-org-ab0082c5" -> null
-       project          = "broad-redirect-prod" -> null
-       state            = "ACTIVE" -> null
-       terraform_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       update_time      = "2025-08-05T13:36:27.287421054Z" -> null
        # (1 unchanged attribute hidden)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadintitute.com"] will be destroyed
  # (because key ["www.broadintitute.com"] is not in for_each map)
- resource "google_certificate_manager_certificate_map_entry" "certificates" {
-       certificates     = [
-           "projects/993744606360/locations/global/certificates/broadintitute-com-ab0082c5",
        ] -> null
-       create_time      = "2025-08-05T13:36:12.878045338Z" -> null
-       description      = "Certificate map entry for broadintitute.com" -> null
-       effective_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       hostname         = "www.broadintitute.com" -> null
-       id               = "projects/broad-redirect-prod/locations/global/certificateMaps/broadinstitute-misspell-ab0082c5/certificateMapEntries/www-broadintitute-com-ab0082c5" -> null
-       labels           = {
-           "acc-test"  = "true"
-           "terraform" = "true"
        } -> null
-       map              = "broadinstitute-misspell-ab0082c5" -> null
-       name             = "www-broadintitute-com-ab0082c5" -> null
-       project          = "broad-redirect-prod" -> null
-       state            = "ACTIVE" -> null
-       terraform_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       update_time      = "2025-08-05T13:36:15.314429322Z" -> null
        # (1 unchanged attribute hidden)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadintitute.org"] will be destroyed
  # (because key ["www.broadintitute.org"] is not in for_each map)
- resource "google_certificate_manager_certificate_map_entry" "certificates" {
-       certificates     = [
-           "projects/993744606360/locations/global/certificates/broadintitute-org-ab0082c5",
        ] -> null
-       create_time      = "2025-08-05T13:36:24.467841488Z" -> null
-       description      = "Certificate map entry for broadintitute.org" -> null
-       effective_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       hostname         = "www.broadintitute.org" -> null
-       id               = "projects/broad-redirect-prod/locations/global/certificateMaps/broadinstitute-misspell-ab0082c5/certificateMapEntries/www-broadintitute-org-ab0082c5" -> null
-       labels           = {
-           "acc-test"  = "true"
-           "terraform" = "true"
        } -> null
-       map              = "broadinstitute-misspell-ab0082c5" -> null
-       name             = "www-broadintitute-org-ab0082c5" -> null
-       project          = "broad-redirect-prod" -> null
-       state            = "ACTIVE" -> null
-       terraform_labels = {
-           "acc-test"                   = "true"
-           "goog-terraform-provisioned" = "true"
-           "terraform"                  = "true"
        } -> null
-       update_time      = "2025-08-05T13:36:28.416326816Z" -> null
        # (1 unchanged attribute hidden)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broad.dev"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broad.dev"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broad-dev-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broad-dev",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broad-dev",
            ]
+           domains                    = [
+               "broad.dev",
+               "www.broad.dev",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broad.im"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broad.im"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broad-im-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broad-im",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broad-im",
            ]
+           domains                    = [
+               "broad.im",
+               "www.broad.im",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broad.institute"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broad.institute"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broad-institute-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broad-institute",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broad-institute",
            ]
+           domains                    = [
+               "broad.institute",
+               "www.broad.institute",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broad.us"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broad.us"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broad-us-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broad-us",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broad-us",
            ]
+           domains                    = [
+               "broad.us",
+               "www.broad.us",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadapis.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadapis.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadapis-org-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadapis-org",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadapis-org",
            ]
+           domains                    = [
+               "broadapis.org",
+               "www.broadapis.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadapps.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadapps.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadapps-com-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadapps-com",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadapps-com",
            ]
+           domains                    = [
+               "broadapps.com",
+               "www.broadapps.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadapps.net"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadapps.net"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadapps-net-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadapps-net",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadapps-net",
            ]
+           domains                    = [
+               "broadapps.net",
+               "www.broadapps.net",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadapps.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadapps.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadapps-org-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadapps-org",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadapps-org",
            ]
+           domains                    = [
+               "broadapps.org",
+               "www.broadapps.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadinstitute-com",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadinstitute-com",
            ]
+           domains                    = [
+               "broadinstitute.com",
+               "www.broadinstitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadinstitute.info"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstitute.info"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstitute-info-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadinstitute-info",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadinstitute-info",
            ]
+           domains                    = [
+               "broadinstitute.info",
+               "www.broadinstitute.info",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstitute.net"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadinstitute-net",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadinstitute-net",
            ]
+           domains                    = [
+               "broadinstitute.net",
+               "www.broadinstitute.net",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadinstitute.tv"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstitute.tv"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstitute-tv-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadinstitute-tv",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadinstitute-tv",
            ]
+           domains                    = [
+               "broadinstitute.tv",
+               "www.broadinstitute.tv",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstitute.us"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broadinstitute-us",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broadinstitute-us",
            ]
+           domains                    = [
+               "broadinstitute.us",
+               "www.broadinstitute.us",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["redirect.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for redirect.broadinstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "redirect-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/redirect-broadinstitute-org",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/localmail-broadinstitute-org",
            ]
+           domains                    = [
+               "redirect.broadinstitute.org",
+               "localmail.broadinstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["test.broadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for test.broadinstitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "test-broadinstitute-com-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/test-broadinstitute-com",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-test-broadinstitute-com",
            ]
+           domains                    = [
+               "test.broadinstitute.com",
+               "www.test.broadinstitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["test.broadinstitute.net"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for test.broadinstitute.net"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "test-broadinstitute-net-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/test-broadinstitute-net",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-test-broadinstitute-net",
            ]
+           domains                    = [
+               "test.broadinstitute.net",
+               "www.test.broadinstitute.net",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["test.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for test.broadinstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "test-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/test-broadinstitute-org",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-test-broadinstitute-org",
            ]
+           domains                    = [
+               "test.broadinstitute.org",
+               "www.test.broadinstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["test.broadinstitute.us"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for test.broadinstitute.us"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "test-broadinstitute-us-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/test-broadinstitute-us",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-test-broadinstitute-us",
            ]
+           domains                    = [
+               "test.broadinstitute.us",
+               "www.test.broadinstitute.us",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["thebroadinstitute.com"] will be created
+ resource "google_certificate_manager_certificate" "cer
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.